Revit 2027 API
BuiltInFailures.MEPFabricationFailures.InvalidSelectionThereCannotBeOpenConnectors Property
 Invalid selection there cannot be any open connectors for the design to fabrication part tool.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidSelectionThereCannotBeOpenConnectors { get; }
Public Shared ReadOnly Property InvalidSelectionThereCannotBeOpenConnectors As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidSelectionThereCannotBeOpenConnectors {
	FailureDefinitionId^ get ();
}
static member InvalidSelectionThereCannotBeOpenConnectors : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace